Repository: yousapramsis/projject
Catalog: lib/l10n/app_*.arb
Languages: ar

# app_title
source: Multiple Disease App
ar: تطبيق متعدد الأمراض

source: Health Assessments
ar: التقييمات الصحية

source: Diabetes
ar: مرض السكري

source: Hypertension
ar: الضغط

source: Heart Health
ar: صحة القلب

# heart_disease_risk_assess
source: Heart Disease Risk Assessment
ar: تقييم خطر الإصابة بأمراض القلب

source: BP Medication
ar: أدوية ضغط الدم

# diabetes_section
source: Diabetes
ar: السكري

# total_cholesterol
source: Total Cholesterol (mg/dL)
ar: الكوليسترول الكلي (ملغم/ديسيلتر)

# systolic_bp
source: Systolic BP (mm Hg)
ar: ضغط الدم الانقباضي (ملم زئبق)

# diastolic_bp
source: Diastolic BP (mm Hg)
ar: ضغط الدم الانبساطي (ملم زئبق)

source: BMI
ar: مؤشر كتلة الجسم

# heart_rate
source: Heart Rate (bpm)
ar: معدل ضربات القلب (ضربة/دقيقة)

# glucose
source: Glucose (mg/dL)
ar: الجلوكوز (ملغم/ديسيلتر)

# enter_metrics
source: Enter your health metrics for an assessment
ar: أدخل مقاييسك الصحية للتقييم

source: Gender
ar: الجنس

source: Age
ar: العمر

source: Smoking Status
ar: حالة التدخين

source: Current Smoker
ar: مدخن حالي

source: Cigarettes Per Day
ar: عدد السجائر يومياً

source: Check Risk
ar: افحص الخطر

# symptoms_check
source: Please check any symptoms you've experienced recently:
ar: الرجاء تحديد أي أعراض تعرضت لها مؤخراً:

# heart_disease_symptoms
source: Heart Disease Symptoms Check
ar: فحص أعراض أمراض القلب

# hypertension_symptoms
source: Hypertension Symptoms Check
ar: فحص أعراض ارتفاع ضغط الدم

# diabetes_risk_assess
source: Diabetes Risk Assessment
ar: تقييم خطر الإصابة بمرض السكري

source: Diabetes Symptoms
ar: أعراض السكري

# provide_health_info
source: Provide accurate health information for reliable results
ar: قدم معلومات صحية دقيقة للحصول على نتائج موثوقة

source: Smoking History
ar: تاريخ التدخين

source: HbA1c (%)
ar: الهيموجلوبين السكري (%)

# result_message
source: Most likely you do not have diabetes.
ar: على الأرجح لا تعاني من مرض السكري.

# result_instruction
source: You've selected fewer than 1 symptoms. If you still want to check, use the button below.
ar: لقد حددت أقل من عرض واحد. إذا كنت لا تزال ترغب في الفحص، استخدم الزر أدناه.

# sleep_advice
source: Get enough sleep each night.
ar: احصل على قسط كافٍ من النوم كل ليلة.

source: Frequent urination
ar: التبول المتكرر

source: Excessive thirst
ar: العطش المفرط

source: Unexplained weight loss
ar: فقدان الوزن غير المبرر

source: Extreme hunger
ar: الجوع الشديد

source: Blurred vision
ar: رؤية ضبابية

source: Increased fatigue
ar: التعب المتزايد

# slow_healing
source: Slow-healing sores
ar: بطء التئام الجروح

source: Frequent infections
ar: الالتهابات المتكررة

# numbness
source: Numbness or tingling in hands/feet
ar: خدر أو تنميل في اليدين/القدمين

source: Severe headaches
ar: صداع شديد

# fatigue_confusion
source: Fatigue or confusion
ar: التعب أو الارتباك

source: Vision problems
ar: مشاكل في الرؤية

source: Chest pain
ar: ألم في الصدر

source: Difficulty breathing
ar: صعوبة في التنفس

# blood_urine
source: Blood in the urine
ar: دم في البول

# pounding
source: Pounding in chest, neck, or ears
ar: خفقان في الصدر أو الرقبة أو الأذنين

source: Nosebleeds
ar: نزيف الأنف

# chest_pain_discomfort
source: Chest pain or discomfort
ar: ألم أو انزعاج في الصدر

# shortness_breath
source: Shortness of breath
ar: ضيق في التنفس

# neck_jaw_pain
source: Pain in the neck, jaw, throat, or back
ar: ألم في الرقبة أو الفك أو الحلق أو الظهر

# limb_pain_numbness
source: Pain or numbness in arms or legs
ar: ألم أو خدر في الذراعين أو الساقين

# fluttering_chest
source: Fluttering in chest
ar: رفرفة في الصدر

# lightheadedness
source: Lightheadedness or dizziness
ar: الدوار أو الدوخة

# swelling
source: Swelling in legs, ankles, or feet
ar: تورم في الساقين أو الكاحلين أو القدمين

source: Irregular Heartbeat
ar: عدم انتظام ضربات القلب

source: Fatigue
ar: التعب

# advice_hydration
source: Stay hydrated by drinking plenty of water.
ar: حافظ على رطوبة جسمك بشرب الكثير من الماء.

# advice_balanced_diet
source: Eat a balanced diet rich in fruits and vegetables.
ar: تناول نظامًا غذائيًا متوازنًا غنيًا بالفواكه والخضروات.

# advice_exercise
source: Exercise regularly to maintain a healthy weight.
ar: مارس التمارين بانتظام للحفاظ على وزن صحي.

# advice_stress
source: Manage stress through relaxation techniques.
ar: التحكم في التوتر من خلال تقنيات الاسترخاء.

# advice_processed_foods
source: Limit your intake of processed foods and sugary drinks.
ar: قلل من تناول الأطعمة المصنعة والمشروبات السكرية.

# advice_smoking
source: Avoid smoking and excessive alcohol consumption.
ar: تجنب التدخين والإفراط في تناول الكحول.

# advice_checkups
source: Get regular checkups with your doctor.
ar: احصل على فحوصات منتظمة مع طبيبك.

# advice_social_life
source: Maintain a healthy social life and strong relationships.
ar: الحفاظ على حياة اجتماعية صحية وعلاقات قوية.

# advice_hygiene
source: Practice good hygiene to prevent infections.
ar: مارس النظافة الجيدة للوقاية من العدوى.

# advice_animal_fats
source: It's best to avoid animal fats for a healthier lifestyle.
ar: من الأفضل تجنب الدهون الحيوانية لنمط حياة أكثر صحة.

# advice_plant_based
source: Include more plant-based foods in your diet for better health.
ar: أدرج المزيد من الأطعمة النباتية في نظامك الغذائي لصحة أفضل.

# important_advice
source: Important Health Advice
ar: نصائح صحية مهمة

source: Important Health Advice
ar: نصائح صحية هامة

# diabetes_warning
source: Potential Diabetes Risk Detected
ar: تحذير: احتمالية الإصابة بمرض السكري

# medical_advice
source: We strongly advise you to consult...
ar: ننصح بشدة باستشارة أخصائي رعاية صحية...

# hospital_recommendation
source: Here is a recommended hospital...
ar: فيما يلي مستشفى موصى به...

# get_location
source: Get Hospital Location
ar: الحصول على موقع المستشفى

# map_error
source: Could not open map location
ar: تعذر فتح موقع الخريطة

# error_occurred
source: An error occurred
ar: حدث خطأ

# invalid_number
source: Invalid number format
ar: تنسيق رقم غير صالح

# must_be_between
source: Value must be between
ar: يجب أن تكون القيمة بين

# gender_male
source: Male
ar: ذكر

# gender_female
source: Female
ar: أنثى

# smoking_never
source: Never
ar: لم يدخن

# smoking_current
source: Current
ar: مدخن حالياً

# smoking_former
source: Former
ar: مدخن سابق

# smoking_no_info
source: No Info
ar: غير محدد

source: Cholesterol
ar: الكوليسترول (ملغم/ديسيلتر)

source: LDL
ar: الكوليسترول الضار (ملغم/ديسيلتر)

source: Triglycerides
ar: الدهون الثلاثية (ملغم/ديسيلتر)

source: HDL
ar: الكوليسترول الجيد (ملغم/ديسيلتر)

source: Positive
ar: إيجابي

source: Negative
ar: سلبي

# model_error
source: Model Error: {error}
ar: خطأ في النموذج: {error}

# result_positive
source: High Risk Detected
ar: تم اكتشاف خطر مرتفع

source: Check Anyway
ar: افحص على أي حال

source: Continue Test
ar: متابعة الاختبار

# hypertension_warning
source: Warning: Potential Hypertension Risk Detected
ar: تحذير: تم اكتشاف خطر محتمل لارتفاع ضغط الدم

# hypertension_description
source: Hypertension is a serious condition...
ar: ارتفاع ضغط الدم حالة خطيرة تتطلب...

# recommended_hospital
source: Here is a recommended hospital...
ar: فيما يلي مستشفى موصى به...

# hypertension_risk_assess
source: Hypertension Risk Assessment
ar: تقييم خطر ارتفاع ضغط الدم

# enter_health_metrics
source: Enter your health metrics...
ar: أدخل مقاييسك الصحية...

# sys_bp
source: Systolic BP
ar: ضغط الدم الانقباضي

# dia_bp
source: Diastolic BP
ar: ضغط الدم الانبساطي

# no_symptoms_warning
source: Most likely you do not have hypertension...
ar: على الأرجح لا تعاني من ارتفاع ضغط الدم...

# no_hypertension_warning
source: Most likely you do not have hypertension disease.
ar: على الأرجح لا تعاني من مرض الضغط.

# isRtl
source: false
ar: true

# select_option
source: Select an option
ar: اختر خيارًا

source: Symptoms Checklist
ar: قائمة الأعراض

source: Heart Disease Symptoms Check
ar: فحص أعراض أمراض القلب

source: Continue to Test
ar: متابعة الاختبار

# most_likely_no_heart_disease
source: Most likely you do not have heart disease.
ar: على الأرجح لا تعاني من أمراض القلب.

# selected_symptoms_count
source: You've selected {count} symptoms. It's recommended to take a heart disease test.
ar: لقد حددت {count} أعراض. يُنصح بإجراء فحص لأمراض القلب.

# positive_heart_risk
source: High Heart Disease Risk Detected
ar: تم اكتشاف خطر مرتفع لأمراض القلب

# heart_disease_warning
source: Heart diseases are serious conditions that require prompt medical attention.
ar: أمراض القلب حالات خطيرة تتطلب عناية طبية فورية.

# hospital_recommendation_heart
source: Here is a recommended cardiology center:
ar: فيما يلي مركز قلب موصى به:

# symptom_chest_pain
source: Chest pain or discomfort
ar: ألم أو انزعاج في الصدر

# symptom_shortness_breath
source: Shortness of breath
ar: ضيق في التنفس

# symptom_neck_pain
source: Pain in the neck, jaw, throat, or back
ar: ألم في الرقبة أو الفك أو الحلق أو الظهر

# symptom_limb_pain
source: Pain or numbness in arms or legs
ar: ألم أو خدر في الذراعين أو الساقين

# symptom_fluttering
source: Fluttering in chest
ar: رفرفة في الصدر

# symptom_fatigue
source: Fatigue
ar: التعب

# symptom_dizziness
source: Lightheadedness or dizziness
ar: الدوار أو الدوخة

# symptom_swelling
source: Swelling in legs, ankles, or feet
ar: تورم في الساقين أو الكاحلين أو القدمين

# symptom_irregular_heartbeat
source: Irregular heartbeat
ar: عدم انتظام ضربات القلب

# no_heart_disease_warning
source: Most likely you do not have heart disease.
ar: على الأرجح لا تعاني من أمراض القلب.

# symptoms_selected_count
source: You've selected {count} symptoms. It's recommended to take a heart disease test.
ar: لقد حددت {count} أعراض. يُنصح بإجراء فحص لأمراض القلب.

# heart_disease_risk_warning
source: Warning: Potential Heart Disease Risk Detected
ar: تحذير: احتمالية الإصابة بأمراض القلب

# heart_disease_warning_text
source: Heart diseases are serious conditions that require prompt medical attention. Early diagnosis and management are crucial for preventing complications.
ar: أمراض القلب حالات خطيرة تتطلب عناية طبية فورية. التشخيص المبكر والعلاج ضروريان لمنع المضاعفات.

# medical_consult_advice
source: We strongly advise you to consult a healthcare professional immediately. Please visit a hospital for further testing and guidance.
ar: ننصح بشدة باستشارة أخصائي رعاية صحية فورًا. يرجى زيارة مستشفى لمزيد من الفحوصات والإرشادات.

source: Get Hospital Location
ar: الحصول على موقع المستشفى

# heart_disease_advice
source: Heart disease requires regular monitoring and lifestyle changes. Follow your doctor's recommendations and maintain a heart-healthy diet.
ar: أمراض القلب تتطلب مراقبة منتظمة وتغييرات في نمط الحياة. اتبع توصيات طبيبك وحافظ على نظام غذائي صحي للقلب.

source: Heart Health Recommendations
ar: توصيات لصحة القلب

# healthy_diet_title
source: Healthy Diet
ar: نظام غذائي صحي

# healthy_diet_description
source: Focus on fruits, vegetables, whole grains, and lean proteins. Limit salt and saturated fats.
ar: ركز على الفواكه والخضروات والحبوب الكاملة والبروتينات الخالية من الدهون. قلل من الملح والدهون المشبعة.

# exercise_title
source: Regular Exercise
ar: تمارين منتظمة

# exercise_description
source: Aim for at least 150 minutes of moderate-intensity exercise per week.
ar: استهدف 150 دقيقة على الأقل من التمارين متوسطة الشدة أسبوعيًا.

# consult_doctor_title
source: Medical Checkups
ar: فحوصات طبية

# consult_doctor_description
source: Regular consultations with your cardiologist are essential for monitoring heart health.
ar: الاستشارات المنتظمة مع طبيب القلب ضرورية لمراقبة صحة القلب.

# and_text
source: and
ar: و

# symptom_headache
source: Severe headaches
ar: صداع شديد

# symptom_vision
source: Vision problems
ar: مشاكل في الرؤية

# symptom_breathing
source: Difficulty breathing
ar: صعوبة في التنفس

# symptom_heartbeat
source: Irregular heartbeat
ar: عدم انتظام ضربات القلب

# symptom_urine
source: Blood in the urine
ar: دم في البول

# symptom_pounding
source: Pounding in chest, neck, or ears
ar: خفقان في الصدر أو الرقبة أو الأذنين

# symptom_nosebleed
source: Nosebleeds
ar: نزيف الأنف

source: Systolic Pressure
ar: ضغط الدم الانقباضي

source: Diastolic Pressure
ar: ضغط الدم الانبساطي

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

# diabetes_advice_content
source: Maintain a healthy diet, exercise regularly, and consult your doctor for further guidance.
ar: حافظ على نظام غذائي صحي، ومارس الرياضة بانتظام، واستشر طبيبك لمزيد من الإرشادات.

source: Failed to load model
ar: فشل في تحميل النموذج

source: Prediction failed
ar: فشل التنبؤ

source: Heart Disease
ar: أمراض القلب

# appTitle
source: My App
ar: تطبيقي

source: Hello
ar: مرحبا

source: Previous Tests
ar: الاختبارات السابقة

source: Tested On
ar: تم الاختبار في

source: Hypertension Advice
ar: نصائح للضغط

# please_fill_all_fields
source: Please fill all fields with valid values.
ar: يرجى ملء جميع الحقول بقيم صالحة.

# info_dialog_title
source: Normal Range Information
ar: معلومات النطاق الطبيعي

source: View normal range
ar: عرض النطاق الطبيعي

# ok_button
source: OK
ar: موافق

# age_range_info
source: Adults typically 18 years and older. Max age for model: 120 years.
ar: البالغون عادة 18 سنة فما فوق. الحد الأقصى للعمر للنموذج: 120 سنة.

# cigs_per_day_range_info
source: Optimal: 0. Any smoking significantly increases risk.
ar: الأمثل: 0. أي تدخين يزيد المخاطر بشكل كبير.

# total_cholesterol_range_info
source: Desirable: < 200 mg/dL. Borderline high: 200-239 mg/dL. High: >= 240 mg/dL.
ar: المستحب: < 200 ملغم/ديسيلتر. قريب من المرتفع: 200-239 ملغم/ديسيلتر. مرتفع: >= 240 ملغم/ديسيلتر.

# systolic_bp_range_info
source: Normal: < 120 mmHg. Elevated: 120-129 mmHg. Stage 1 HTN: 130-139 mmHg. Stage 2 HTN: >= 140 mmHg.
ar: الطبيعي: < 120 ملم زئبقي. مرتفع قليلاً: 120-129 ملم زئبقي. ارتفاع ضغط الدم مرحلة 1: 130-139 ملم زئبقي. ارتفاع ضغط الدم مرحلة 2: >= 140 ملم زئبقي.

# diastolic_bp_range_info
source: Normal: < 80 mmHg. Stage 1 HTN: 80-89 mmHg. Stage 2 HTN: >= 90 mmHg.
ar: الطبيعي: < 80 ملم زئبقي. ارتفاع ضغط الدم مرحلة 1: 80-89 ملم زئبقي. ارتفاع ضغط الدم مرحلة 2: >= 90 ملم زئبقي.

# bmi_range_info
source: Underweight: < 18.5. Normal weight: 18.5–24.9. Overweight: 25–29.9. Obesity: >= 30.
ar: نقص الوزن: < 18.5. الوزن الطبيعي: 18.5-24.9. زيادة الوزن: 25-29.9. السمنة: >= 30.

# heart_rate_range_info
source: Normal resting heart rate: 60–100 beats per minute.
ar: معدل ضربات القلب الطبيعي أثناء الراحة: 60-100 نبضة في الدقيقة.

# glucose_range_info
source: Normal fasting glucose: 70–99 mg/dL. Prediabetes: 100-125 mg/dL. Diabetes: >= 126 mg/dL.
ar: سكر الصائم الطبيعي: 70-99 ملغم/ديسيلتر. مقدمات السكري: 100-125 ملغم/ديسيلتر. السكري: >= 126 ملغم/ديسيلتر.

# hba1c_range_info
source: Normal: Below 5.7%. Prediabetes: 5.7% to 6.4%. Diabetes: 6.5% or higher.
ar: الطبيعي: أقل من 5.7%. مقدمات السكري: 5.7% إلى 6.4%. السكري: 6.5% أو أعلى.

# ldl_range_info
source: Optimal: < 100 mg/dL. Near optimal: 100-129 mg/dL. Borderline high: 130-159 mg/dL. High: 160-189 mg/dL. Very high: >= 190 mg/dL.
ar: الأمثل: < 100 ملغم/ديسيلتر. قريب من الأمثل: 100-129 ملغم/ديسيلتر. قريب من المرتفع: 130-159 ملغم/ديسيلتر. مرتفع: 160-189 ملغم/ديسيلتر. مرتفع جداً: >= 190 ملغم/ديسيلتر.

# triglycerides_range_info
source: Normal: < 150 mg/dL. Borderline high: 150-199 mg/dL. High: 200-499 mg/dL. Very high: >= 500 mg/dL.
ar: الطبيعي: < 150 ملغم/ديسيلتر. قريب من المرتفع: 150-199 ملغم/ديسيلتر. مرتفع: 200-499 ملغم/ديسيلتر. مرتفع جداً: >= 500 ملغم/ديسيلتر.

# hdl_range_info
source: Low (increased risk): < 40 mg/dL (men), < 50 mg/dL (women). Optimal (protective): >= 60 mg/dL.
ar: منخفض (زيادة الخطر): < 40 ملغم/ديسيلتر (رجال)، < 50 ملغم/ديسيلتر (نساء). الأمثل (وقائي): >= 60 ملغم/ديسيلتر.

source: Normal Range
ar: النطاق الطبيعي

source: Normal range for
ar: النطاق الطبيعي لـ

source: OK
ar: حسناً
